omod/src/main/resources/org/openmrs/module/casereport/templates/retrieveDocumentSetb.xml

--MIMEBoundaryurn_uuid_DCD262C64C22DB97351256303951323
Content-Type: application/xop+xml; charset=UTF-8; type="application/soap+xml"
Content-Transfer-Encoding: binary
Content-ID: <0.urn:uuid:DCD262C64C22DB97351256303951324@apache.org>

<soap:Envelope xmlns="urn:ihe:iti:xds-b:2007" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:urn1="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:urn2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:urn3="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
	<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:Action xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">urn:ihe:iti:2007:RetrieveDocumentSet</wsa:Action>
		<wsa:To env:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope">https://192.168.1.80:5000/xdsrepository</wsa:To>
		<wsa:MessageID>urn:uuid:#{{messageId}}</wsa:MessageID>
		<wsa:ReplyTo env:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing" xmlns:env="http://www.w3.org/2003/05/soap-envelope">
			<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
		</wsa:ReplyTo>
	</soap:Header>
	<soap:Body>
      <xds:RetrieveDocumentSetRequest xmlns:xds="urn:ihe:iti:xds-b:2007">
         <xds:DocumentRequest>
            <xds:RepositoryUniqueId>1.19.6.24.109.42.1.5.1</xds:RepositoryUniqueId>
            <xds:DocumentUniqueId>2.25.301616414821655765791088986049896540835</xds:DocumentUniqueId>
         </xds:DocumentRequest>
      </xds:RetrieveDocumentSetRequest>
	</soap:Body>
</soap:Envelope>
--MIMEBoundaryurn_uuid_DCD262C64C22DB97351256303951323--
